Repository: omarvbnet/khidma-app
Catalog: waddiny/lib/l10n/app_*.arb
Languages: ar, ku, tr

# appTitle
source: Waddiny
ar: وديني
ku: وەدینی

source: Welcome Back
ar: مرحبًا بعودتك
ku: بەخێربێیتەوە
tr: Tekrar Hoş Geldiniz

source: Login
ar: تسجيل الدخول
ku: چوونەژوورەوە
tr: Giriş Yap

source: Register
ar: تسجيل جديد
ku: تۆمارکردن
tr: Kayıt Ol

source: Phone Number
ar: رقم الهاتف
ku: ژمارەی مۆبایل
tr: Telefon Numarası

source: Password
ar: كلمة المرور
ku: وشەی نهێنی
tr: Şifre

source: Full Name
ar: الاسم الكامل
ku: ناوی تەواو
tr: Ad Soyad

# pleaseEnterPhoneNumber
source: Please enter your phone number
ar: يرجى إدخال رقم الهاتف
ku: تکایە ژمارەی مۆبایلت بنووسە
tr: Lütfen telefon numaranızı girin

# pleaseEnterPassword
source: Please enter your password
ar: يرجى إدخال كلمة المرور
ku: تکایە وشەی نهێنیت بنووسە
tr: Lütfen şifrenizi girin

# pleaseEnterFullName
source: Please enter your full name
ar: يرجى إدخال الاسم الكامل
ku: تکایە ناوی تەواوت بنووسە
tr: Lütfen ad soyadınızı girin

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل
ku: وشەی نهێنی دەبێت لانیکەم ٦ پیت بێت
tr: Şifre en az 6 karakter olmalıdır

# dontHaveAccount
source: Don't have an account? Register
ar: ليس لديك حساب؟ سجل الآن
ku: هەژمارت نییە؟ تۆمار بکە
tr: Hesabınız yok mu? Kayıt olun

source: Choose Registration Type
ar: اختر نوع التسجيل
ku: جۆری تۆمارکردن هەڵبژێرە
tr: Kayıt Türünü Seçin

source: Register as User
ar: تسجيل كمستخدم
ku: وەک بەکارهێنەر تۆمار بکە
tr: Kullanıcı Olarak Kayıt Ol

source: Register as Driver
ar: تسجيل كسائق
ku: وەک شۆفێر تۆمار بکە
tr: Sürücü Olarak Kayıt Ol

source: Car ID
ar: رقم السيارة
ku: ناسنامەی ئۆتۆمبێل
tr: Araç ID

source: Car Type
ar: نوع السيارة
ku: جۆری ئۆتۆمبێل
tr: Araç Türü

source: License ID
ar: رقم الرخصة
ku: ناسنامەی مۆڵەت
tr: Lisans ID

# pleaseEnterCarId
source: Please enter your car ID
ar: يرجى إدخال رقم السيارة
ku: تکایە ناسنامەی ئۆتۆمبێلت بنووسە
tr: Lütfen araç ID'nizi girin

# pleaseEnterCarType
source: Please enter your car type
ar: يرجى إدخال نوع السيارة
ku: تکایە جۆری ئۆتۆمبێلت بنووسە
tr: Lütfen araç türünüzü girin

# pleaseEnterLicenseId
source: Please enter your license ID
ar: يرجى إدخال رقم الرخصة
ku: تکایە ناسنامەی مۆڵەتت بنووسە
tr: Lütfen lisans ID'nizi girin

source: Verify Phone Number
ar: تأكيد رقم الهاتف
ku: ژمارەی مۆبایل پشتڕاست بکەرەوە
tr: Telefon Numarasını Doğrula

# enterOtpSentTo
source: Enter the OTP sent to {phoneNumber}
ar: أدخل رمز التحقق المرسل إلى {phoneNumber}
ku: کۆدی OTP بنووسە کە نێردراوە بۆ {phoneNumber}
tr: {phoneNumber} numarasına gönderilen OTP'yi girin

source: OTP
ar: رمز التحقق
ku: کۆدی OTP

# pleaseEnterOtp
source: Please enter the OTP
ar: يرجى إدخال رمز التحقق
ku: تکایە کۆدی OTP بنووسە
tr: Lütfen OTP'yi girin

source: Verify OTP
ar: تأكيد الرمز
ku: کۆدی OTP پشتڕاست بکەرەوە
tr: OTP'yi Doğrula

source: Resend OTP
ar: إعادة إرسال الرمز
ku: کۆدی OTP دووبارە ناردەوە
tr: OTP'yi Tekrar Gönder

source: Home
ar: الرئيسية
ku: سەرەکی
tr: Ana Sayfa

# welcomeUser
source: Welcome, {name}!
ar: مرحبًا، {name}!
ku: بەخێربێیت، {name}!
tr: Hoş geldiniz, {name}!

source: Where would you like to go?
ar: إلى أين تريد الذهاب؟
ku: دەتەوێت بچیت بۆ کوێ؟
tr: Nereye gitmek istiyorsunuz?

source: Create New Trip
ar: إنشاء رحلة جديدة
ku: گەشتی نوێ دروست بکە
tr: Yeni Yolculuk Oluştur

source: Recent Trips
ar: الرحلات الأخيرة
ku: گەشتە دواترەکان
tr: Son Yolculuklar

source: No trips yet
ar: لا توجد رحلات بعد
ku: هێشتا گەشت نییە
tr: Henüz yolculuk yok

# errorLoadingTrips
source: Error loading trips: {error}
ar: حدث خطأ أثناء تحميل الرحلات: {error}
ku: هەڵە لە بارکردنی گەشتەکان: {error}
tr: Yolculuklar yüklenirken hata: {error}

# tripTo
source: Trip to {location}
ar: رحلة إلى {location}
ku: گەشت بۆ {location}
tr: {location} yolculuğu

source: From
ar: من
ku: لە
tr: Nereden

# accountStatus
source: Status
ar: الحالة
ku: دۆخ
tr: Durum

source: Price
ar: السعر
ku: نرخ
tr: Fiyat

source: Waiting Trips
ar: الرحلات المنتظرة
ku: چاوەڕوانی گەشتەکان
tr: Bekleyen Yolculuklar

source: No waiting trips
ar: لا توجد رحلات منتظرة
ku: هیچ گەشتی چاوەڕوان نییە
tr: Bekleyen yolculuk yok

source: New Trips Available!
ar: رحلات جديدة متاحة!
ku: گەشتی نوێ بەردەستە!
tr: Yeni Yolculuklar Mevcut!

# newTripsWaiting
source: {count} new trip{count, plural, one {} other {s}} waiting for you
ar: {count} رحلة جديدة بانتظارك
ku: {count} گەشتی نوێ{count, plural, one {} other {}} چاوەڕوانت دەکەن
tr: Sizin için {count} yeni yolculuk{count, plural, one {} other {lar}} bekliyor

# newTripAvailable
source: New trip available: {message}
ar: رحلة جديدة متاحة: {message}
ku: گەشتی نوێ بەردەستە: {message}
tr: Yeni yolculuk mevcut: {message}

# checkListBelow
source: Check the list below
ar: تحقق من القائمة أدناه
ku: لیستەی خوارەوە پشکنە
tr: Aşağıdaki listeyi kontrol edin

# generalNotification
source: General notification received, refreshing trips...
ar: تم استلام إشعار عام، جاري تحديث الرحلات...
ku: ئاگادارکردنەوەی گشتی وەرگیرا، گەشتەکان نوێ دەکرێنەوە...
tr: Genel bildirim alındı, yolculuklar yenileniyor...

# notificationTapped
source: Notification tapped (background): {data}
ar: تم النقر على الإشعار (الخلفية): {data}
ku: ئاگادارکردنەوە لێدرا (پشتەوە): {data}
tr: Bildirim dokunuldu (arka plan): {data}

# appLaunchedFromNotification
source: App launched from notification: {data}
ar: تم تشغيل التطبيق من الإشعار: {data}
ku: ئەپەکە لە ئاگادارکردنەوەوە دەستی پێکرد: {data}
tr: Uygulama bildirimden başlatıldı: {data}

# noInitialMessage
source: No initial message found
ar: لا توجد رسالة أولية
ku: هیچ پەیامی سەرەتایی نەدۆزرایەوە
tr: İlk mesaj bulunamadı

# errorGettingInitialMessage
source: Error getting initial message: {error}
ar: خطأ في الحصول على الرسالة الأولية: {error}
ku: هەڵە لە وەرگرتنی پەیامی سەرەتایی: {error}
tr: İlk mesaj alınırken hata: {error}

source: Notification-triggered trip refresh...
ar: تحديث الرحلات المحفز بالإشعار...
ku: نوێکردنەوەی گەشت بە هۆی ئاگادارکردنەوە...
tr: Bildirim tetiklemeli yolculuk yenileme...

# tripListUpdated
source: Trip list updated with {count} waiting trips
ar: تم تحديث قائمة الرحلات بـ {count} رحلة منتظرة
ku: لیستەی گەشتەکان نوێکرایەوە بە {count} گەشتی چاوەڕوان
tr: Yolculuk listesi {count} bekleyen yolculukla güncellendi

# errorInNotificationTripRefresh
source: Error in notification-triggered trip refresh: {error}
ar: خطأ في تحديث الرحلات المحفز بالإشعار: {error}
ku: هەڵە لە نوێکردنەوەی گەشت بە هۆی ئاگادارکردنەوە: {error}
tr: Bildirim tetiklemeli yolculuk yenilemede hata: {error}

# networkError
source: Network error. Tap to retry.
ar: خطأ في الشبكة. اضغط لإعادة المحاولة.
ku: هەڵەی تۆڕ. تکایە دووبارە هەوڵبدە.
tr: Ağ hatası. Tekrar denemek için dokunun.

source: Retry
ar: إعادة المحاولة
ku: دووبارە هەوڵبدە
tr: Tekrar Dene

source: Refresh
ar: تحديث
ku: نوێکردنەوە
tr: Yenile

source: Loading trip information...
ar: جاري تحميل معلومات الرحلة...
ku: زانیاری گەشت بار دەکرێت...
tr: Yolculuk bilgileri yükleniyor...

# errorLoadingData
source: Error loading data: {error}
ar: حدث خطأ أثناء تحميل البيانات: {error}
ku: هەڵە لە بارکردنی داتا: {error}
tr: Veri yüklenirken hata: {error}

# requestTimeout
source: Request timeout - please check your internet connection
ar: انتهت مهلة الطلب - يرجى التحقق من الاتصال بالإنترنت
ku: کاتی داواکاری تەواو بوو - تکایە پەیوەندی ئینتەرنێتت پشکنە
tr: İstek zaman aşımı - lütfen internet bağlantınızı kontrol edin

# errorCheckingUserStatus
source: Error checking user status: {error}
ar: خطأ في التحقق من حالة المستخدم: {error}
ku: هەڵە لە پشکنینی دۆخی بەکارهێنەر: {error}
tr: Kullanıcı durumu kontrol edilirken hata: {error}

# errorLoadingDriverBudget
source: Error loading driver budget: {error}
ar: خطأ في تحميل رصيد السائق: {error}
ku: هەڵە لە بارکردنی بودیجەی شۆفێر: {error}
tr: Sürücü bütçesi yüklenirken hata: {error}

# errorLoadingCarInfo
source: Error loading car info: {error}
ar: خطأ في تحميل معلومات السيارة: {error}
ku: هەڵە لە بارکردنی زانیاری ئۆتۆمبێل: {error}
tr: Araç bilgileri yüklenirken hata: {error}

# errorLoggingOut
source: Error logging out: {error}
ar: خطأ في تسجيل الخروج: {error}
ku: هەڵە لە چوونەدەرەوە: {error}
tr: Çıkış yapılırken hata: {error}

# errorLoadingProfile
source: Error loading profile: {error}
ar: خطأ في تحميل الملف الشخصي: {error}
ku: هەڵە لە بارکردنی پرۆفایل: {error}
tr: Profil yüklenirken hata: {error}

# errorLoadingUserData
source: Error loading user data: {error}
ar: خطأ في تحميل بيانات المستخدم: {error}
ku: هەڵە لە بارکردنی داتای بەکارهێنەر: {error}
tr: Kullanıcı verileri yüklenirken hata: {error}

source: No user data found
ar: لم يتم العثور على بيانات المستخدم
ku: هیچ داتایەکی بەکارهێنەر نەدۆزرایەوە
tr: Kullanıcı verisi bulunamadı

source: Go to Login
ar: اذهب إلى تسجيل الدخول
ku: بڕۆ بۆ چوونەژوورەوە
tr: Giriş Sayfasına Git

source: Budget
ar: الرصيد
ku: بودیجە
tr: Bütçe

source: Test Budget
ar: اختبار الرصيد
ku: تاقیکردنەوەی بودیجە
tr: Bütçe Testi

source: Budget Information
ar: معلومات الرصيد
ku: زانیاری بودیجە
tr: Bütçe Bilgileri

# currentBudget
source: Current Budget: {amount} IQD
ar: الرصيد الحالي: {amount} دينار
ku: بودیجەی ئێستا: {amount} دینار
tr: Mevcut Bütçe: {amount} IQD

source: Driver: {name}
ar: السائق: {name}
ku: شۆفێر: {name}
tr: Sürücü: {name}

# budgetDeductionNote
source: Note: 12% of trip price is deducted when accepting a trip.
ar: ملاحظة: يتم خصم 12% من سعر الرحلة عند قبول الرحلة.
ku: تێبینی: ١٢٪ لە نرخی گەشت کەم دەکرێتەوە کاتێک گەشتەکە قبوڵ دەکرێت.
tr: Not: Yolculuk kabul edildiğinde yolculuk fiyatının %12'si kesilir.

# addTestBudget
source: Add 1000 IQD (Test)
ar: إضافة 1000 دينار (اختبار)
ku: زیادکردنی ١٠٠٠ دینار (تاقی)
tr: 1000 IQD Ekle (Test)

# budgetAdded
source: Budget added: {amount} IQD
ar: تمت إضافة الرصيد: {amount} دينار
ku: بودیجە زیادکرا: {amount} دینار
tr: Bütçe eklendi: {amount} IQD

# errorAddingBudget
source: Error adding budget: {error}
ar: خطأ في إضافة الرصيد: {error}
ku: هەڵە لە زیادکردنی بودیجە: {error}
tr: Bütçe eklenirken hata: {error}

# budgetTest
source: Budget test: {message} - Current: {currentBudget} IQD
ar: اختبار الرصيد: {message} - الحالي: {currentBudget} دينار
ku: تاقیکردنەوەی بودیجە: {message} - ئێستا: {currentBudget} دینار
tr: Bütçe testi: {message} - Mevcut: {currentBudget} IQD

# budgetTestError
source: Budget test error: {error}
ar: خطأ في اختبار الميزانية: {error}
ku: هەڵەی تاقیکردنەوەی بودجە: {error}
tr: Bütçe test hatası: {error}

# deduction
source: Deduction: {amount} IQD (12%)
ar: الخصم: {amount} دينار (12%)
ku: کەمکردنەوە: {amount} دینار (١٢٪)
tr: Kesinti: {amount} IQD (%12)

# yourBudget
source: Your budget: {budget} IQD
ar: رصيدك: {budget} دينار
ku: بودیجەکەت: {budget} دینار
tr: Bütçeniz: {budget} IQD

source: Insufficient budget
ar: الرصيد غير كافٍ
ku: بودیجەی نەگونجاو
tr: Yetersiz bütçe

source: View Budget
ar: عرض الرصيد
ku: بودیجە ببینە
tr: Bütçeyi Görüntüle

source: Province Filtering
ar: تصفية المحافظة
ku: پاڵاوتنی پارێزگا
tr: İl Filtresi

# provinceFilteringDescription
source: You only see trips from users in the same province as you. This ensures better service quality and faster response times.
ar: ترى فقط الرحلات من المستخدمين في نفس المحافظة. هذا يضمن جودة خدمة أفضل وأوقات استجابة أسرع.
ku: تەنها گەشتەکانی بەکارهێنەرانی هەمان پارێزگا دەبینیت. ئەمە جۆرایەتی خزمەتگوزاری باشتر و کاتی وەڵامدانی خێراتر دەدات.
tr: Sadece aynı ildeki kullanıcılardan gelen yolculukları görürsünüz. Bu, daha iyi hizmet kalitesi ve daha hızlı yanıt süreleri sağlar.

# newTripRequestsWillAppear
source: New trip requests will appear here automatically
ar: طلبات الرحلات الجديدة ستظهر هنا تلقائيًا
ku: داواکاری گەشتی نوێ بە شێوەیەکی ئۆتۆماتیکی لێرە دەردەکەون
tr: Yeni yolculuk talepleri burada otomatik olarak görünecek

# youllReceiveNotifications
source: You'll receive notifications for new trips in your province
ar: ستتلقى إشعارات بالرحلات الجديدة في محافظتك
ku: بۆ گەشتی نوێ لە پارێزگاکەت ئاگادارکردنەوە وەردەگریتەوە
tr: İlinizdeki yeni yolculuklar için bildirim alacaksınız

source: Trip Details
ar: تفاصيل الرحلة
ku: وردەکاری گەشت
tr: Yolculuk Detayları

source: Accept Trip
ar: قبول الرحلة
ku: قبوڵکردنی گەشت
tr: Yolculuğu Kabul Et

source: View Trip
ar: عرض الرحلة
ku: بینینی گەشت
tr: Yolculuğu Görüntüle

# tripNumber
source: Trip #{id}
ar: رحلة #{id}
ku: گەشت #{id}
tr: Yolculuk #{id}

source: To
ar: إلى
ku: بۆ
tr: Nereye

source: Distance
ar: المسافة
ku: دووری
tr: Mesafe

source: User
ar: المستخدم
ku: بەکارهێنەر
tr: Kullanıcı

source: Phone
ar: الهاتف
ku: تەلەفۆن
tr: Telefon

# errorLoadingTripDetails
source: Error loading trip details: {error}
ar: حدث خطأ أثناء تحميل تفاصيل الرحلة: {error}
ku: هەڵە لە بارکردنی وردەکاری گەشت: {error}
tr: Yolculuk detayları yüklenirken hata: {error}

# invalidCoordinatesInTripData
source: Invalid coordinates in trip data. Please contact support.
ar: إحداثيات غير صالحة في بيانات الرحلة. يرجى التواصل مع الدعم.
ku: ناونیشانی نادروست لە زانیاری گەشت. تکایە پەیوەندی بکە بە پشتیوانی.
tr: Yolculuk verilerinde geçersiz koordinatlar. Lütfen destek ile iletişime geçin.

# accountNotActive
source: Your account is not active. Please contact support.
ar: حسابك غير مفعل. يرجى التواصل مع الدعم.
ku: هەژمارت چالاک نییە. تکایە پەیوەندی بکە بە پشتیوانی.
tr: Hesabınız aktif değil. Lütfen destek ile iletişime geçin.

# invalidCoordinates
source: Invalid coordinates in trip data. Please contact support.
ar: إحداثيات غير صالحة في بيانات الرحلة. يرجى التواصل مع الدعم.
ku: ناونیشانی نادروست لە زانیاری گەشت. تکایە پەیوەندی بکە بە پشتیوانی.
tr: Yolculuk verilerinde geçersiz koordinatlar. Lütfen destek ile iletişime geçin.

source: Driver Profile
ar: ملف السائق
ku: پرۆفایلی شۆفێر
tr: Sürücü Profili

source: User Profile
ar: ملف المستخدم الشخصي
ku: پرۆفایلی بەکارهێنەر
tr: Kullanıcı Profili

source: Car Information
ar: معلومات السيارة
ku: زانیاری ئۆتۆمبێل
tr: Araç Bilgileri

source: Account Information
ar: معلومات الحساب
ku: زانیاری هەژمار
tr: Hesap Bilgileri

source: Personal Information
ar: المعلومات الشخصية
ku: زانیاری کەسی
tr: Kişisel Bilgiler

source: Account Type
ar: نوع الحساب
ku: جۆری هەژمار
tr: Hesap Türü

source: Member Since
ar: عضو منذ
ku: ئەندام لە
tr: Üyelik Tarihi

source: Rating
ar: التقييم
ku: هەڵسەنگاندن
tr: Değerlendirme

source: Province
ar: المحافظة
ku: پارێزگا
tr: İl

source: Language
ar: اللغة
ku: زمان
tr: Dil

# current
source: Current: {flag} {language}
ar: الحالية: {flag} {language}
ku: ئێستا: {flag} {language}
tr: Mevcut: {flag} {language}

# tapLanguageToChange
source: Tap a language to change the app language
ar: اضغط على اللغة لتغيير لغة التطبيق
ku: بۆ گۆڕینی زمانی ئەپەکە کلیک لەسەر زمانێک بکە
tr: Uygulama dilini değiştirmek için bir dile dokunun

# languageChangedTo
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}
ku: زمان گۆڕدرا بۆ {language}
tr: Dil {language} olarak değiştirildi

# languageChangedRestart
source: Language changed! Please restart the app for full effect.
ar: تم تغيير اللغة! يرجى إعادة تشغيل التطبيق لتطبيق التغيير.
ku: زمان گۆڕدرا! تکایە بۆ کاریگەری تەواو ئەپەکە دووبارە دەست پێبکەرەوە.
tr: Dil değiştirildi! Tam etki için lütfen uygulamayı yeniden başlatın.

source: Search Location
ar: بحث عن موقع
ku: گەڕان بۆ شوێن
tr: Konum Ara

source: Pickup Location
ar: موقع الاستلام
ku: شوێنی وەرگرتن
tr: Alış Konumu

source: Dropoff Location
ar: موقع النزول
ku: شوێنی دانان
tr: Bırakış Konumu

# errorGettingLocation
source: Error getting location: {error}
ar: خطأ في الحصول على الموقع: {error}
ku: هەڵە لە وەرگرتنی شوێن: {error}
tr: Konum alınırken hata: {error}

# errorSearchingLocation
source: Error searching location: {error}
ar: خطأ في البحث عن الموقع: {error}
ku: هەڵە لە گەڕان بۆ شوێن: {error}
tr: Konum aranırken hata: {error}

# pleaseSelectPickupDropoff
source: Please select pickup and dropoff locations
ar: يرجى اختيار مواقع الاستلام والنزول
ku: تکایە شوێنی وەرگرتن و دانان هەڵبژێرە
tr: Lütfen alış ve bırakış konumlarını seçin

# pleaseEnterBothAddresses
source: Please enter both pickup and dropoff addresses
ar: يرجى إدخال عناوين الاستلام والنزول
ku: تکایە هەردوو ناونیشانی وەرگرتن و دانان بنووسە
tr: Lütfen hem alış hem de bırakış adreslerini girin

# yourAccountNotActive
source: Your account is not active. Please contact support.
ar: حسابك غير مفعل. يرجى التواصل مع الدعم.
ku: هەژمارت چالاک نییە. تکایە پەیوەندی بکە بە پشتیوانی.
tr: Hesabınız aktif değil. Lütfen destek ile iletişime geçin.

source: Create Trip
ar: إنشاء رحلة
ku: گەشت دروست بکە
tr: Yolculuk Oluştur

source: {distance} km
ar: {distance} كم
ku: {distance} کیلۆمەتر

# estimatedPrice
source: Estimated Price: {price} IQD
ar: السعر المقدر: {price} دينار
ku: نرخی خەملاندن: {price} دینار
tr: Tahmini Fiyat: {price} IQD

source: Confirm Trip
ar: تأكيد الرحلة
ku: گەشتەکە پشتڕاست بکەرەوە
tr: Yolculuğu Onayla

# tripCreated
source: Trip created successfully!
ar: تم إنشاء الرحلة بنجاح!
ku: گەشتەکە بە سەرکەوتوویی دروستکرا!
tr: Yolculuk başarıyla oluşturuldu!

source: Error creating trip
ar: خطأ في إنشاء الرحلة
ku: هەڵە لە دروستکردنی گەشت: {error}
tr: Yolculuk oluşturulurken hata

source: Driver Navigation
ar: ملاحة السائق
ku: ڕێنمایی شۆفێر
tr: Sürücü Navigasyonu

# mapsMeStyleNavigation
source: Maps.me style navigation - route to destination
ar: ملاحة Maps.me - المسار إلى الوجهة
ku: ڕێنمایی بە شێوەی Maps.me - ڕێگە بۆ ناوچە
tr: Maps.me tarzı navigasyon - hedefe rota

source: Actual Movement Test
ar: اختبار الحركة الفعلية
ku: تاقیکردنەوەی جووڵەی ڕاستەقینە
tr: Gerçek Hareket Testi

source: OK
ar: موافق
ku: باشە
tr: Tamam

source: Maps.me Info
ar: معلومات Maps.me
ku: زانیاری Maps.me
tr: Maps.me Bilgisi

source: Actual phone movement tracking:
ar: تتبع حركة الهاتف الفعلية:
ku: شوێنکەوتنی جووڵەی ڕاستەقینەی مۆبایل:
tr: Gerçek telefon hareket takibi:

# movePhoneLeft
source: 1. Move phone LEFT → Camera and car follow LEFT
ar: 1. حرّك الهاتف لليسار → الكاميرا والسيارة يتبعان اليسار
ku: ١. مۆبایل بە چەپ بجووڵێنە → کامێرا و ئۆتۆمبێل چەپ شوێن دەکەون
tr: 1. Telefonu SOLA hareket ettir → Kamera ve araç SOLA takip eder

# movePhoneRight
source: 2. Move phone RIGHT → Camera and car follow RIGHT
ar: 2. حرّك الهاتف لليمين → الكاميرا والسيارة يتبعان اليمين
ku: ٢. مۆبایل بە ڕاست بجووڵێنە → کامێرا و ئۆتۆمبێل ڕاست شوێن دەکەن
tr: 2. Telefonu SAĞA hareket ettir → Kamera ve araç SAĞA takip eder

# bothFollowActualMovement
source: 3. Both follow actual movement direction
ar: 3. كلاهما يتبعان اتجاه الحركة الفعلية
ku: ٣. هەردووکیان شوێنی ئاراستەی جووڵەی ڕاستەقینە دەکەن
tr: 3. Her ikisi de gerçek hareket yönünü takip eder

# gpsBasedMovementTracking
source: 4. GPS-based movement tracking
ar: 4. تتبع الحركة بناءً على GPS
ku: ٤. شوێنکەوتنی جووڵە بە پێی GPS
tr: 4. GPS tabanlı hareket takibi

# realTimeMovementFollowing
source: 5. Real-time movement following
ar: 5. تتبع الحركة في الوقت الفعلي
ku: ٥. شوێنکەوتنی جووڵە بە کاتی ڕاستەقینە
tr: 5. Gerçek zamanlı hareket takibi

# gpsHeadingCameraCar
source: GPS heading: {heading}° Camera & car follow actual movement
ar: اتجاه GPS: {heading}° الكاميرا والسيارة تتبعان الحركة الفعلية
ku: ئاراستەی GPS: {heading}° کامێرا و ئۆتۆمبێل جووڵەی ڕاستەقینە شوێن دەکەن
tr: GPS yönü: {heading}° Kamera ve araç gerçek hareketi takip eder

source: Maps.me style features:
ar: ميزات نمط Maps.me:
ku: تایبەتمەندی بە شێوەی Maps.me:
tr: Maps.me tarzı özellikler:

source: • Route to destination
ar: • المسار إلى الوجهة
ku: • ڕێگە بۆ ناوچە
tr: • Hedefe rota

source: • GPS-based navigation
ar: • ملاحة تعتمد على GPS
ku: • ڕێنمایی بە پێی GPS
tr: • GPS tabanlı navigasyon

source: • Clean interface
ar: • واجهة نظيفة
ku: • ڕووکاری پاک
tr: • Temiz arayüz

source: • No direction controls
ar: • بدون عناصر تحكم في الاتجاه
ku: • هیچ کۆنترۆڵێکی ئاراستە نییە
tr: • Yön kontrolleri yok

# focusOnRoadAhead
source: • Focus on the road ahead
ar: • التركيز على الطريق أمامك
ku: • سەرنج لەسەر ڕێگەی پێشەوە
tr: • Öndeki yola odaklan

# actualMovementTrackingInstructions
source: Actual phone movement tracking:
ar: تتبع حركة الهاتف الفعلية:
ku: شوێنکەوتنی جووڵەی ڕاستەقینەی مۆبایل:
tr: Gerçek telefon hareket takibi:

# tripStatusSuccess
source: Trip status updated successfully
ar: تم تحديث حالة الرحلة بنجاح
ku: دۆخی گەشت بە سەرکەوتوویی نوێکرایەوە
tr: Yolculuk durumu başarıyla güncellendi

# errorUpdatingTrip
source: Error updating trip status
ar: خطأ في تحديث حالة الرحلة
ku: هەڵە لە نوێکردنەوەی دۆخی گەشت
tr: Yolculuk durumu güncellenirken hata

source: Speed
ar: السرعة
ku: خێرایی
tr: Hız

source: Debug Info
ar: معلومات التصحيح
ku: زانیاری هەڵەگرتنەوە
tr: Hata Ayıklama Bilgisi

source: Status: {status}
ar: الحالة: {status}
ku: دۆخ: {status}
tr: Durum: {status}

# distanceDistance
source: Distance: {distance} km
ar: المسافة: {distance} كم
ku: دووری: {distance} کیلۆمەتر
tr: Mesafe: {distance} km

# autoArrivalAutoArrival
source: Auto-arrival within 150m
ar: الوصول التلقائي ضمن 150 متر
ku: خۆکارانە گەیشتن لە ماوەی ١٥٠م
tr: 150m içinde otomatik varış

source: Actual
ar: فعلي
ku: ڕاستەقینە
tr: Gerçek

source: Movement
ar: الحركة
ku: جووڵە
tr: Hareket

source: Reset
ar: إعادة تعيين
ku: سڕینەوە
tr: Sıfırla

source: North
ar: الشمال
ku: باکوور
tr: Kuzey

source: Close to pickup location
ar: قريب من موقع الاستلام
ku: لە نزیک شوێنی وەرگرتن
tr: Alış konumuna yakın

source: I have arrived
ar: لقد وصلت
ku: هاتم
tr: Vardım

source: User picked up
ar: تم استلام المستخدم
ku: بەکارهێنەر وەرگیرا
tr: Kullanıcı alındı

source: Confirm picked up
ar: تأكيد الاستلام
ku: وەرگرتنەکە پشتڕاست بکەرەوە
tr: Alındığını onayla

source: You have arrived at your destination
ar: لقد وصلت إلى وجهتك
ku: گەیشتیت بۆ ناوچەکەت
tr: Hedefinize vardınız

source: Complete Trip
ar: إكمال الرحلة
ku: گەشتەکە تەواو بکە
tr: Yolculuğu Tamamla

source: Waiting for driver
ar: في انتظار السائق
ku: چاوەڕوانی شۆفێر
tr: Sürücü bekleniyor

source: Driver accepted
ar: قبل السائق
ku: شۆفێر قبوڵی کرد
tr: Sürücü kabul etti

source: Driver is on the way
ar: السائق في الطريق
ku: شۆفێر لە ڕێگەدایە
tr: Sürücü yolda

source: Driver has arrived
ar: وصل السائق
ku: شۆفێر هات
tr: Sürücü vardı

source: You are picked up
ar: تم استلامك
ku: وەرگیرایت
tr: Alındınız

source: On the way to destination
ar: في الطريق إلى الوجهة
ku: لە ڕێگەدا بۆ ناوچە
tr: Hedefe giderken

source: Trip completed
ar: اكتملت الرحلة
ku: گەشتەکە تەواو بوو
tr: Yolculuk tamamlandı

source: Unknown status
ar: حالة غير معروفة
ku: دۆخی نەناسراو
tr: Bilinmeyen durum

source: Maps.me Navigation
ar: ملاحة Maps.me
ku: ڕێنمایی Maps.me
tr: Maps.me Navigasyonu

source: Maps.me style navigation instructions:
ar: تعليمات ملاحة نمط Maps.me:
ku: ڕێنمایی بە شێوەی Maps.me:
tr: Maps.me tarzı navigasyon talimatları:

source: User Navigation
ar: ملاحة المستخدم
ku: ڕێنمایی بەکارهێنەر
tr: Kullanıcı Navigasyonu

source: Arrived at Pickup
ar: وصل إلى موقع الاستلام
ku: گەیشت بۆ شوێنی وەرگرتن
tr: Alış Noktasına Vardı

source: Arrived at Dropoff
ar: وصل إلى موقع النزول
ku: گەیشت بۆ شوێنی دانان
tr: Bırakış Noktasına Vardı

source: Pickup Passenger
ar: استلام الراكب
ku: سەرنشین وەربگرە
tr: Yolcu Al

source: Cancel Trip
ar: إلغاء الرحلة
ku: گەشتەکە هەڵوەشێنەرەوە
tr: Yolculuğu İptal Et

# driverNear
source: Driver is near!
ar: السائق قريب!
ku: شۆفێر لە نزیکدایە!
tr: Sürücü yakın!

# driverApproaching
source: Your driver is approaching your location
ar: سائقك يقترب من موقعك
ku: شۆفێرەکەت لە نزیک شوێنەکەتە
tr: Sürücünüz konumunuza yaklaşıyor

source: Trip Cancelled
ar: تم إلغاء الرحلة
ku: گەشتەکە هەڵوەشێندرایەوە
tr: Yolculuk İptal Edildi

source: Trip in Progress
ar: الرحلة قيد التنفيذ
ku: گەشت لە پڕۆسەدایە
tr: Yolculuk Devam Ediyor

# driverOnWay
source: Driver on the way
ar: السائق في الطريق
ku: شۆفێر لە ڕێگەدایە
tr: Sürücü yolda

source: Driver arrived
ar: وصل السائق
ku: شۆفێر هات
tr: Sürücü vardı

source: Passenger picked up
ar: تم استلام الراكب
ku: سەرنشین وەرگیرا
tr: Yolcu alındı

source: Arrived at destination
ar: وصل إلى الوجهة
ku: گەیشت بۆ ناوچە
tr: Hedefe vardı

source: Notifications
ar: الإشعارات
ku: ئاگادارکردنەوەکان
tr: Bildirimler

source: No notifications
ar: لا توجد إشعارات
ku: هیچ ئاگادارکردنەوەیەک نییە
tr: Bildirim yok

# markAllRead
source: Mark all as read
ar: تحديد الكل كمقروء
ku: هەموویان وەک خوێندراوە نیشانە بکە
tr: Tümünü okundu olarak işaretle
