Repository: omarvbnet/khidma-app
Catalog: waddiny/lib/l10n/app_*.arb
Languages: ar, ku, tr

source: Clear all
ar: مسح الكل
ku: هەموویان پاک بکەرەوە
tr: Tümünü temizle

source: Trips
ar: الرحلات
ku: گەشتەکان
tr: Yolculuklar

source: Trip History
ar: سجل الرحلات
ku: مێژووی گەشت
tr: Yolculuk Geçmişi

source: Active Trips
ar: الرحلات النشطة
ku: گەشتە چالاکەکان
tr: Aktif Yolculuklar

source: Completed Trips
ar: الرحلات المكتملة
ku: گەشتە تەواوکراوەکان
tr: Tamamlanan Yolculuklar

source: Cancelled Trips
ar: الرحلات الملغاة
ku: گەشتە هەڵوەشێندراوەکان
tr: İptal Edilen Yolculuklar

source: No active trips
ar: لا توجد رحلات نشطة
ku: هیچ گەشتی چالاک نییە
tr: Aktif yolculuk yok

source: No completed trips
ar: لا توجد رحلات مكتملة
ku: هیچ گەشتی تەواوکراو نییە
tr: Tamamlanan yolculuk yok

source: No cancelled trips
ar: لا توجد رحلات ملغاة
ku: هیچ گەشتی هەڵوەشێندراو نییە
tr: İptal edilen yolculuk yok

source: Logout
ar: تسجيل الخروج
ku: چوونەدەرەوە
tr: Çıkış Yap

source: Settings
ar: الإعدادات
ku: ڕێکخستنەکان
tr: Ayarlar

source: Help
ar: المساعدة
ku: یارمەتی
tr: Yardım

source: Support
ar: الدعم
ku: پشتیوانی
tr: Destek

source: About
ar: حول
ku: دەربارە
tr: Hakkında

source: Version
ar: الإصدار
ku: وەشان
tr: Sürüm

source: Privacy Policy
ar: سياسة الخصوصية
ku: سیاسەتی تایبەتمەندی
tr: Gizlilik Politikası

source: Terms of Service
ar: شروط الخدمة
ku: مەرجەکانی خزمەتگوزاری
tr: Kullanım Şartları

source: Cancel
ar: إلغاء
ku: هەڵوەشێنەرەوە
tr: İptal

source: Yes
ar: نعم
ku: بەڵێ
tr: Evet

source: No
ar: لا
ku: نەخێر
tr: Hayır

source: Save
ar: حفظ
ku: پاشەکەوت بکە
tr: Kaydet

source: Edit
ar: تعديل
ku: دەستکاری بکە
tr: Düzenle

source: Delete
ar: حذف
ku: سڕینەوە
tr: Sil

source: Confirm
ar: تأكيد
ku: پشتڕاست بکەرەوە
tr: Onayla

source: Back
ar: رجوع
ku: گەڕانەوە
tr: Geri

source: Next
ar: التالي
ku: دواتر
tr: İleri

source: Previous
ar: السابق
ku: پێشوو
tr: Önceki

source: Close
ar: إغلاق
ku: داخستن
tr: Kapat

source: Done
ar: تم
ku: تەواو
tr: Tamam

source: Loading...
ar: جاري التحميل...
ku: بار دەکرێت...
tr: Yükleniyor...

source: Error
ar: خطأ
ku: هەڵە
tr: Hata

source: Success
ar: نجح
ku: سەرکەوتوو
tr: Başarılı

source: Warning
ar: تحذير
ku: ئاگادارکردنەوە
tr: Uyarı

# info
source: Information
ar: معلومات
ku: زانیاری
tr: Bilgi

source: Permissions
ar: الأذونات
ku: مۆڵەتەکان
tr: İzinler

source: Location Permission
ar: إذن الموقع
ku: مۆڵەتی شوێن
tr: Konum İzni

source: Notification Permission
ar: إذن الإشعارات
ku: مۆڵەتی ئاگادارکردنەوە
tr: Bildirim İzni

source: Camera Permission
ar: إذن الكاميرا
ku: مۆڵەتی کامێرا
tr: Kamera İzni

source: Microphone Permission
ar: إذن الميكروفون
ku: مۆڵەتی مایکرۆفۆن
tr: Mikrofon İzni

source: Permission Required
ar: الأذن مطلوب
ku: مۆڵەت پێویستە
tr: İzin Gerekli

source: Permission Denied
ar: تم رفض الإذن
ku: مۆڵەت ڕەتکرایەوە
tr: İzin Reddedildi

source: Permission Granted
ar: تم منح الإذن
ku: مۆڵەت درا
tr: İzin Verildi

# enablePermissions
source: Please enable the required permissions in your device settings.
ar: يرجى تمكين الأذونات المطلوبة في إعدادات جهازك.
ku: تکایە مۆڵەتە پێویستەکان لە ڕێکخستنەکانی ئامێرەکەت چالاک بکە.
tr: Lütfen gerekli izinleri cihaz ayarlarınızda etkinleştirin.

source: Network
ar: الشبكة
ku: تۆڕ
tr: Ağ

source: No internet connection
ar: لا يوجد اتصال بالإنترنت
ku: هیچ پەیوەندی ئینتەرنێت نییە
tr: İnternet bağlantısı yok

# checkConnection
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.
ku: تکایە پەیوەندی ئینتەرنێتت پشکنە و دووبارە هەوڵبدە.
tr: Lütfen internet bağlantınızı kontrol edin ve tekrar deneyin.

source: Server error
ar: خطأ في الخادم
ku: هەڵەی سێرڤەر
tr: Sunucu hatası

# timeout
source: Request timeout
ar: انتهت مهلة الطلب
ku: کاتی داواکاری تەواو بوو
tr: İstek zaman aşımı

source: Connection error
ar: خطأ في الاتصال
ku: هەڵەی پەیوەندی
tr: Bağlantı hatası

source: Map
ar: الخريطة
ku: نەخشە
tr: Harita

source: Current Location
ar: الموقع الحالي
ku: شوێنی ئێستا
tr: Mevcut Konum

source: Destination
ar: الوجهة
ku: ناوچە
tr: Hedef

source: Route
ar: المسار
ku: ڕێگە
tr: Rota

source: Directions
ar: الاتجاهات
ku: ئاراستەکان
tr: Yönler

source: Navigation
ar: الملاحة
ku: ڕێنمایی
tr: Navigasyon

source: Location
ar: الموقع
ku: شوێن
tr: Konum

source: Address
ar: العنوان
ku: ناونیشان
tr: Adres

source: Coordinates
ar: الإحداثيات
ku: ناونیشانەکان
tr: Koordinatlar

source: Time
ar: الوقت
ku: کات
tr: Zaman

source: Date
ar: التاريخ
ku: بەروار
tr: Tarih

source: Duration
ar: المدة
ku: ماوە
tr: Süre

source: Estimated Time
ar: الوقت المقدر
ku: کاتی خەملاندن
tr: Tahmini Süre

source: Arrival Time
ar: وقت الوصول
ku: کاتی گەیشتن
tr: Varış Zamanı

source: Departure Time
ar: وقت المغادرة
ku: کاتی ڕۆشتن
tr: Kalkış Zamanı

# currency
source: IQD
ar: دينار
ku: دینار

source: Amount
ar: المبلغ
ku: بڕ
tr: Miktar

source: Total
ar: المجموع
ku: کۆی گشتی
tr: Toplam

source: Subtotal
ar: المجموع الفرعي
ku: کۆی ناوەڕاست
tr: Ara Toplam

source: Tax
ar: الضريبة
ku: باج
tr: Vergi

source: Discount
ar: الخصم
ku: داشکاندن
tr: İndirim

source: Fee
ar: الرسوم
ku: کرێ
tr: Ücret

source: Cost
ar: التكلفة
ku: تێچوو
tr: Maliyet

source: Fare
ar: الأجرة
ku: کرێ
tr: Ücret

# statusUserWaiting
source: User Waiting
ar: المستخدم ينتظر
ku: بەکارهێنەر چاوەڕوانە
tr: Kullanıcı Bekliyor

# statusDriverAccepted
source: Driver Accepted
ar: تم قبول السائق
ku: شۆفێر قبوڵی کرد
tr: Sürücü Kabul Etti

# statusDriverInWay
source: Driver on the way
ar: السائق في الطريق
ku: شۆفێر لە ڕێگەدایە
tr: Sürücü Yolda

# statusDriverArrived
source: Driver Arrived
ar: وصل السائق
ku: شۆفێر هات
tr: Sürücü Vardı

# statusUserPickedUp
source: User Picked Up
ar: تم استلام المستخدم
ku: بەکارهێنەر وەرگیرا
tr: Kullanıcı Alındı

# statusDriverInProgress
source: Driver in Progress
ar: السائق في تقدم
ku: شۆفێر لە پڕۆسەدایە
tr: Sürücü Devam Ediyor

# statusDriverArrivedDropoff
source: Driver Arrived at Dropoff
ar: وصل السائق إلى نقطة النزول
ku: شۆفێر گەیشت بۆ شوێنی دانان
tr: Sürücü Bırakış Noktasına Vardı

# statusTripCompleted
source: Trip Completed
ar: تمت الرحلة
ku: گەشت تەواو بوو
tr: Yolculuk Tamamlandı

# statusTripCancelled
source: Trip Cancelled
ar: تم إلغاء الرحلة
ku: گەشت هەڵوەشێندرایەوە
tr: Yolculuk İptal Edildi

source: Status
ar: الحالة
ku: دۆخ
tr: Durum

# autoArrival
source: Auto-arrival within 150m
ar: الوصول التلقائي ضمن 150 متر
ku: خۆکارانە گەیشتن لە ماوەی ١٥٠م
tr: 150m içinde otomatik varış

source: Profile
ar: الملف الشخصي
ku: پرۆفایل
tr: Profil

source: Trip
ar: رحلة
ku: گەشت
tr: Yolculuk

source: No trips available
ar: لا توجد رحلات متاحة
ku: هیچ گەشتێک بەردەست نییە
tr: Yolculuk mevcut değil

# newTripsWillAppearHere
source: New trip requests will appear here automatically
ar: ستظهر طلبات الرحلات الجديدة هنا تلقائياً
ku: داواکاری گەشتی نوێ بە شێوەیەکی ئۆتۆماتیکی لێرە دەردەکەون
tr: Yeni yolculuk talepleri burada otomatik olarak görünecek

# youWillReceiveNotifications
source: You'll receive notifications for new trips in your province
ar: ستتلقى إشعارات للرحلات الجديدة في محافظتك
ku: بۆ گەشتی نوێ لە پارێزگاکەت ئاگادارکردنەوە وەردەگریتەوە
tr: İlinizdeki yeni yolculuklar için bildirim alacaksınız

source: My Trips
ar: رحلاتي
ku: گەشتەکانم
tr: Yolculuklarım

source: Driver ID
ar: معرف السائق
ku: ناسنامەی شۆفێر
tr: Sürücü ID

source: User ID
ar: معرف المستخدم
ku: ناسنامەی بەکارهێنەر
tr: Kullanıcı ID

source: Accepted At
ar: تم القبول في
ku: قبوڵکرا لە
tr: Kabul Edildi

source: Completed At
ar: تم الإكمال في
ku: تەواو بوو لە
tr: Tamamlandı

# statusCompleted
source: Completed
ar: مكتملة
ku: تەواو بوو
tr: Tamamlandı

# statusCancelled
source: Cancelled
ar: ملغية
ku: هەڵوەشێندرایەوە
tr: İptal Edildi

# statusInProgress
source: In Progress
ar: قيد التنفيذ
ku: لە پڕۆسەدایە
tr: Devam Ediyor

# statusAccepted
source: Accepted
ar: مقبولة
ku: قبوڵکرا
tr: Kabul Edildi

# statusWaiting
source: Waiting
ar: في الانتظار
ku: چاوەڕوانە
tr: Bekliyor

source: Driver
ar: السائق
ku: شۆفێر
tr: Sürücü

source: Driver Phone
ar: هاتف السائق
ku: تەلەفۆنی شۆفێر
tr: Sürücü Telefonu

source: Driver Rating
ar: تقييم السائق
ku: هەڵسەنگاندنی شۆفێر
tr: Sürücü Değerlendirmesi

# cancelTripConfirmation
source: Cancel Trip
ar: إلغاء الرحلة
ku: گەشتەکە هەڵوەشێنەرەوە
tr: Yolculuğu İptal Et

# cancelTripMessage
source: Are you sure you want to cancel this trip?
ar: هل أنت متأكد من أنك تريد إلغاء هذه الرحلة؟
ku: دڵنیای لە هەڵوەشێنەرەوەی ئەم گەشتە؟
tr: Bu yolculuğu iptal etmek istediğinizden emin misiniz?

source: Trip cancelled successfully
ar: تم إلغاء الرحلة بنجاح
ku: گەشتەکە بە سەرکەوتوویی هەڵوەشێندرایەوە
tr: Yolculuk başarıyla iptal edildi

# waitingForDriverTitle
source: Waiting for driver...
ar: في انتظار السائق...
ku: چاوەڕوانی شۆفێر...
tr: Sürücü bekleniyor...

# tripCompletedTitle
source: Trip Completed!
ar: تمت الرحلة!
ku: گەشتەکە تەواو بوو!
tr: Yolculuk Tamamlandı!

# thankYouForUsingService
source: Thank you for using our service
ar: شكراً لاستخدام خدمتنا
ku: سوپاس بۆ بەکارهێنانی خزمەتگوزاریمان
tr: Hizmetimizi kullandığınız için teşekkürler

# countdownMessage
source: Returning to home in {countdown} seconds
ar: العودة إلى الرئيسية خلال {countdown} ثانية
ku: گەڕانەوە بۆ سەرەکی لە ماوەی {countdown} چرکە
tr: Ana sayfaya {countdown} saniye içinde dönülüyor

source: Return to Home Now
ar: العودة إلى الرئيسية الآن
ku: ئێستا بگەڕێرەوە بۆ سەرەکی
tr: Şimdi Ana Sayfaya Dön

# errorCancellingTrip
source: Error cancelling trip: {error}
ar: خطأ في إلغاء الرحلة: {error}
ku: هەڵە لە هەڵوەشێنەرەوەی گەشت: {error}
tr: Yolculuk iptal edilirken hata: {error}

source: Pickup
ar: الاستلام
ku: وەرگرتن
tr: Alış

source: Dropoff
ar: النزول
ku: داخستن
tr: Bırakış

source: Waiting Time
ar: وقت الانتظار
ku: کاتی چاوەڕوانی
tr: Bekleme Süresi

# acceptTripButton
source: Accept Trip
ar: قبول الرحلة
ku: گەشتەکە قبوڵ بکە
tr: Yolculuğu Kabul Et

# viewTripButton
source: View Trip
ar: عرض الرحلة
ku: گەشتەکە ببینە
tr: Yolculuğu Görüntüle

# errorAcceptingTrip
source: Error accepting trip: {error}
ar: خطأ في قبول الرحلة: {error}
ku: هەڵە لە قبوڵکردنی گەشت: {error}
tr: Yolculuk kabul edilirken hata: {error}

# insufficientBudgetMessage
source: Insufficient budget
ar: الميزانية غير كافية
ku: بودجە بەس نییە
tr: Yetersiz bütçe

# viewBudgetButton
source: View Budget
ar: عرض الميزانية
ku: بودجە ببینە
tr: Bütçeyi Görüntüle

# budgetInformationTitle
source: Budget Information
ar: معلومات الميزانية
ku: زانیاری بودجە
tr: Bütçe Bilgisi

# currentBudgetLabel
source: Current Budget: {amount} IQD
ar: الميزانية الحالية: {amount} دينار
ku: بودجەی ئێستا: {amount} دینار
tr: Mevcut Bütçe: {amount} IQD

# driverNameLabel
source: Driver: {name}
ar: السائق: {name}
ku: شۆفێر: {name}
tr: Sürücü: {name}

# addTestBudgetButton
source: Add 1000 IQD (Test)
ar: إضافة 1000 دينار (اختبار)
ku: ١٠٠٠ دینار زیاد بکە (تاقیکردنەوە)
tr: 1000 IQD Ekle (Test)

# budgetAddedMessage
source: Budget added: {amount} IQD
ar: تمت إضافة الميزانية: {amount} دينار
ku: بودجە زیادکرا: {amount} دینار
tr: Bütçe eklendi: {amount} IQD

# errorAddingBudgetMessage
source: Error adding budget: {error}
ar: خطأ في إضافة الميزانية: {error}
ku: هەڵە لە زیادکردنی بودجە: {error}
tr: Bütçe eklenirken hata: {error}

# budgetTestMessage
source: Budget test: {message} - Current: {currentBudget} IQD
ar: اختبار الميزانية: {message} - الحالية: {currentBudget} دينار
ku: تاقیکردنەوەی بودجە: {message} - ئێستا: {currentBudget} دینار
tr: Bütçe testi: {message} - Mevcut: {currentBudget} IQD

# deductionLabel
source: Deduction: {amount} IQD (12%)
ar: الخصم: {amount} دينار (12%)
ku: کەمکردنەوە: {amount} دینار (١٢٪)
tr: Kesinti: {amount} IQD (%12)

# yourBudgetLabel
source: Your budget: {budget} IQD
ar: ميزانيتك: {budget} دينار
ku: بودجەکەت: {budget} دینار
tr: Bütçeniz: {budget} IQD

# insufficientBudgetLabel
source: Insufficient budget
ar: الميزانية غير كافية
ku: بودجە بەس نییە
tr: Yetersiz bütçe

# viewBudgetLabel
source: View Budget
ar: عرض الميزانية
ku: بودجە ببینە
tr: Bütçeyi Görüntüle

# provinceFilteringTitle
source: Province Filtering
ar: تصفية المحافظة
ku: پاڵاوتنی پارێزگا
tr: İl Filtresi

# newTripRequestsWillAppearMessage
source: New trip requests will appear here automatically
ar: ستظهر طلبات الرحلات الجديدة هنا تلقائياً
ku: داواکاری گەشتی نوێ بە شێوەیەکی ئۆتۆماتیکی لێرە دەردەکەون
tr: Yeni yolculuk talepleri burada otomatik olarak görünecek

# youWillReceiveNotificationsMessage
source: You'll receive notifications for new trips in your province
ar: ستتلقى إشعارات للرحلات الجديدة في محافظتك
ku: بۆ گەشتی نوێ لە پارێزگاکەت ئاگادارکردنەوە وەردەگریتەوە
tr: İlinizdeki yeni yolculuklar için bildirim alacaksınız

# refreshButton
source: Refresh
ar: تحديث
ku: نوێکردنەوە
tr: Yenile

# retryButton
source: Retry
ar: إعادة المحاولة
ku: دووبارە هەوڵبدە
tr: Tekrar Dene

# loadingTripInformationMessage
source: Loading trip information...
ar: جاري تحميل معلومات الرحلة...
ku: زانیاری گەشت بار دەکرێت...
tr: Yolculuk bilgileri yükleniyor...

# myTripsTitle
source: My Trips
ar: رحلاتي
ku: گەشتەکانم
tr: Yolculuklarım

# tripNumberLabel
source: Trip #{id}
ar: رحلة #{id}
ku: گەشت #{id}
tr: Yolculuk #{id}

# fromLabel
source: From
ar: من
ku: لە
tr: Nereden

# toLabel
source: To
ar: إلى
ku: بۆ
tr: Nereye

# dateLabel
source: Date
ar: التاريخ
ku: بەروار
tr: Tarih

# priceLabel
source: Price
ar: السعر
ku: نرخ
tr: Fiyat

# driverIdLabel
source: Driver ID
ar: معرف السائق
ku: ناسنامەی شۆفێر
tr: Sürücü ID

# userIdLabel
source: User ID
ar: معرف المستخدم
ku: ناسنامەی بەکارهێنەر
tr: Kullanıcı ID

# provinceLabel
source: Province
ar: المحافظة
ku: پارێزگا
tr: İl

# acceptedAtLabel
source: Accepted At
ar: تم القبول في
ku: قبوڵکرا لە
tr: Kabul Edildi

# completedAtLabel
source: Completed At
ar: تم الإكمال في
ku: تەواو بوو لە
tr: Tamamlandı

# statusCompletedLabel
source: Completed
ar: مكتملة
ku: تەواو بوو
tr: Tamamlandı

# statusCancelledLabel
source: Cancelled
ar: ملغية
ku: هەڵوەشێندرایەوە
tr: İptal Edildi

# statusInProgressLabel
source: In Progress
ar: قيد التنفيذ
ku: لە پڕۆسەدایە
tr: Devam Ediyor

# statusAcceptedLabel
source: Accepted
ar: مقبولة
ku: قبوڵکرا
tr: Kabul Edildi

# statusWaitingLabel
source: Waiting
ar: في الانتظار
ku: چاوەڕوانە
tr: Bekliyor

# driverLabel
source: Driver
ar: السائق
ku: شۆفێر
tr: Sürücü

# driverPhoneLabel
source: Driver Phone
ar: هاتف السائق
ku: تەلەفۆنی شۆفێر
tr: Sürücü Telefonu

# driverRatingLabel
source: Driver Rating
ar: تقييم السائق
ku: هەڵسەنگاندنی شۆفێر
tr: Sürücü Değerlendirmesi

# cancelTripConfirmationTitle
source: Cancel Trip
ar: إلغاء الرحلة
ku: گەشتەکە هەڵوەشێنەرەوە
tr: Yolculuğu İptal Et

# cancelTripMessageText
source: Are you sure you want to cancel this trip?
ar: هل أنت متأكد من أنك تريد إلغاء هذه الرحلة؟
ku: دڵنیای لە هەڵوەشێنەرەوەی ئەم گەشتە؟
tr: Bu yolculuğu iptal etmek istediğinizden emin misiniz?

# tripCancelledSuccessfullyMessage
source: Trip cancelled successfully
ar: تم إلغاء الرحلة بنجاح
ku: گەشتەکە بە سەرکەوتوویی هەڵوەشێندرایەوە
tr: Yolculuk başarıyla iptal edildi

# errorLoadingTripDetailsMessage
source: Error loading trip details: {error}
ar: خطأ في تحميل تفاصيل الرحلة: {error}
ku: هەڵە لە بارکردنی وردەکاری گەشت: {error}
tr: Yolculuk detayları yüklenirken hata: {error}

# invalidCoordinatesMessage
source: Invalid coordinates in trip data. Please contact support.
ar: إحداثيات غير صحيحة في بيانات الرحلة. يرجى الاتصال بالدعم.
ku: ناونیشانە نادروستەکان لە داتای گەشت. تکایە پەیوەندی بە پشتگیریکردنەوە بکە.
tr: Yolculuk verilerinde geçersiz koordinatlar. Lütfen destek ile iletişime geçin.

# accountNotActiveMessage
source: Your account is not active. Please contact support.
ar: حسابك غير نشط. يرجى الاتصال بالدعم.
ku: هەژمارەکەت چالاک نییە. تکایە پەیوەندی بە پشتگیریکردنەوە بکە.
tr: Hesabınız aktif değil. Lütfen destek ile iletişime geçin.

# invalidCoordinatesErrorMessage
source: Invalid coordinates in trip data. Please contact support.
ar: إحداثيات غير صحيحة في بيانات الرحلة. يرجى الاتصال بالدعم.
ku: ناونیشانە نادروستەکان لە داتای گەشت. تکایە پەیوەندی بە پشتگیریکردنەوە بکە.
tr: Yolculuk verilerinde geçersiz koordinatlar. Lütfen destek ile iletişime geçin.

# driverProfileTitle
source: Driver Profile
ar: ملف السائق الشخصي
ku: پرۆفایلی شۆفێر
tr: Sürücü Profili

# userProfileTitle
source: User Profile
ar: ملف المستخدم الشخصي
ku: پرۆفایلی بەکارهێنەر
tr: Kullanıcı Profili

# carInformationTitle
source: Car Information
ar: معلومات السيارة
ku: زانیاری ئۆتۆمبێل
tr: Araç Bilgisi

# accountInformationTitle
source: Account Information
ar: معلومات الحساب
ku: زانیاری هەژمار
tr: Hesap Bilgisi

# personalInformationTitle
source: Personal Information
ar: المعلومات الشخصية
ku: زانیاری کەسی
tr: Kişisel Bilgi

# accountTypeLabel
source: Account Type
ar: نوع الحساب
ku: جۆری هەژمار
tr: Hesap Türü

# memberSinceLabel
source: Member Since
ar: عضو منذ
ku: ئەندام لە
tr: Üye Olma Tarihi

# ratingLabel
source: Rating
ar: التقييم
ku: هەڵسەنگاندن
tr: Değerlendirme

# accountStatusLabel
source: Status
ar: الحالة
ku: دۆخ
tr: Durum

# languageTitle
source: Language
ar: اللغة
ku: زمان
tr: Dil

# currentLanguage
source: Current: {flag} {language}
ar: الحالية: {flag} {language}
ku: ئێستا: {flag} {language}
tr: Mevcut: {flag} {language}

# tapLanguageToChangeMessage
source: Tap a language to change the app language
ar: انقر على لغة لتغيير لغة التطبيق
ku: لێدانی زمان بۆ گۆڕینی زمانی ئەپ
tr: Uygulama dilini değiştirmek için bir dile dokunun

# languageChangedToMessage
source: Language changed to {language}
ar: تم تغيير اللغة إلى {language}
ku: زمان گۆڕدرا بۆ {language}
tr: Dil {language} olarak değiştirildi

# languageChangedRestartMessage
source: Language changed! Please restart the app for full effect.
ar: تم تغيير اللغة! يرجى إعادة تشغيل التطبيق للتأثير الكامل.
ku: زمان گۆڕدرا! تکایە ئەپەکە دووبارە بەدەستەوە بکە بۆ کاریگەری تەواو.
tr: Dil değiştirildi! Tam etki için lütfen uygulamayı yeniden başlatın.

# searchLocationTitle
source: Search Location
ar: البحث عن موقع
ku: گەڕان بۆ شوێن
tr: Konum Ara

# pickupLocationLabel
source: Pickup Location
ar: موقع الاستلام
ku: شوێنی وەرگرتن
tr: Alış Konumu

# dropoffLocationLabel
source: Dropoff Location
ar: موقع النزول
ku: شوێنی دانان
tr: Bırakış Konumu

# errorGettingLocationMessage
source: Error getting location: {error}
ar: خطأ في الحصول على الموقع: {error}
ku: هەڵە لە وەرگرتنی شوێن: {error}
tr: Konum alınırken hata: {error}

# errorSearchingLocationMessage
source: Error searching location: {error}
ar: خطأ في البحث عن الموقع: {error}
ku: هەڵە لە گەڕان بۆ شوێن: {error}
tr: Konum aranırken hata: {error}

# pleaseSelectPickupDropoffMessage
source: Please select pickup and dropoff locations
ar: يرجى تحديد مواقع الاستلام والنزول
ku: تکایە شوێنی وەرگرتن و دانان هەڵبژێرە
tr: Lütfen alış ve bırakış konumlarını seçin

# pleaseEnterBothAddressesMessage
source: Please enter both pickup and dropoff addresses
ar: يرجى إدخال عناوين الاستلام والنزول
ku: تکایە ناونیشانی وەرگرتن و دانان بنووسە
tr: Lütfen alış ve bırakış adreslerini girin

# yourAccountNotActiveMessage
source: Your account is not active. Please contact support.
ar: حسابك غير نشط. يرجى الاتصال بالدعم.
ku: هەژمارەکەت چالاک نییە. تکایە پەیوەندی بە پشتگیریکردنەوە بکە.
tr: Hesabınız aktif değil. Lütfen destek ile iletişime geçin.

# createTripTitle
source: Create Trip
ar: إنشاء رحلة
ku: گەشت دروست بکە
tr: Yolculuk Oluştur

# distanceKmLabel
source: {distance} km
ar: {distance} كم
ku: {distance} کیلۆمەتر

# estimatedPriceLabel
source: Estimated Price: {price} IQD
ar: السعر المقدر: {price} دينار
ku: نرخی خەملاندن: {price} دینار
tr: Tahmini Fiyat: {price} IQD

# confirmTripTitle
source: Confirm Trip
ar: تأكيد الرحلة
ku: گەشتەکە پشتڕاست بکەرەوە
tr: Yolculuğu Onayla

# tripCreatedMessage
source: Trip created successfully!
ar: تم إنشاء الرحلة بنجاح!
ku: گەشتەکە بە سەرکەوتوویی دروستکرا!
tr: Yolculuk başarıyla oluşturuldu!

# errorCreatingTripMessage
source: Error creating trip: {error}
ar: خطأ في إنشاء الرحلة: {error}
ku: هەڵە لە دروستکردنی گەشت: {error}
tr: Yolculuk oluşturulurken hata: {error}

# driverNavigationTitle
source: Driver Navigation
ar: ملاحة السائق
ku: ڕێنمایی شۆفێر
tr: Sürücü Navigasyonu

# mapsMeStyleNavigationMessage
source: Maps.me style navigation - route to destination
ar: ملاحة Maps.me - المسار إلى الوجهة
ku: ڕێنمایی بە شێوەی Maps.me - ڕێگە بۆ ناوچە
tr: Maps.me tarzı navigasyon - hedefe rota

# actualMovementTestTitle
source: Actual Movement Test
ar: اختبار الحركة الفعلية
ku: تاقیکردنەوەی جووڵەی ڕاستەقینە
tr: Gerçek Hareket Testi

# okButton
source: OK
ar: موافق
ku: باشە
tr: Tamam

# mapsMeInfoTitle
source: Maps.me Info
ar: معلومات Maps.me
ku: زانیاری Maps.me
tr: Maps.me Bilgisi

# actualPhoneMovementTrackingTitle
source: Actual phone movement tracking:
ar: تتبع حركة الهاتف الفعلية:
ku: شوێنکەوتنی جووڵەی ڕاستەقینەی مۆبایل:
tr: Gerçek telefon hareket takibi:

# movePhoneLeftMessage
source: 1. Move phone LEFT → Camera and car follow LEFT
ar: 1. حرّك الهاتف لليسار → الكاميرا والسيارة يتبعان اليسار
ku: ١. مۆبایل بە چەپ بجووڵێنە → کامێرا و ئۆتۆمبێل چەپ شوێن دەکەون
tr: 1. Telefonu SOLA hareket ettir → Kamera ve araç SOLA takip eder

# movePhoneRightMessage
source: 2. Move phone RIGHT → Camera and car follow RIGHT
ar: 2. حرّك الهاتف لليمين → الكاميرا والسيارة يتبعان اليمين
ku: ٢. مۆبایل بە ڕاست بجووڵێنە → کامێرا و ئۆتۆمبێل ڕاست شوێن دەکەن
tr: 2. Telefonu SAĞA hareket ettir → Kamera ve araç SAĞA takip eder

# bothFollowActualMovementMessage
source: 3. Both follow actual movement direction
ar: 3. كلاهما يتبعان اتجاه الحركة الفعلية
ku: ٣. هەردووکیان شوێنی ئاراستەی جووڵەی ڕاستەقینە دەکەن
tr: 3. Her ikisi de gerçek hareket yönünü takip eder

# gpsBasedMovementTrackingMessage
source: 4. GPS-based movement tracking
ar: 4. تتبع الحركة بناءً على GPS
ku: ٤. شوێنکەوتنی جووڵە بە پێی GPS
tr: 4. GPS tabanlı hareket takibi

# realTimeMovementFollowingMessage
source: 5. Real-time movement following
ar: 5. تتبع الحركة في الوقت الفعلي
ku: ٥. شوێنکەوتنی جووڵە بە کاتی ڕاستەقینە
tr: 5. Gerçek zamanlı hareket takibi

# gpsHeadingCameraCarMessage
source: GPS heading: {heading}° Camera & car follow actual movement
ar: اتجاه GPS: {heading}° الكاميرا والسيارة تتبعان الحركة الفعلية
ku: ئاراستەی GPS: {heading}° کامێرا و ئۆتۆمبێل جووڵەی ڕاستەقینە شوێن دەکەن
tr: GPS yönü: {heading}° Kamera ve araç gerçek hareketi takip eder

# mapsMeStyleFeaturesTitle
source: Maps.me style features:
ar: ميزات نمط Maps.me:
ku: تایبەتمەندی بە شێوەی Maps.me:
tr: Maps.me tarzı özellikler:

# routeToDestinationMessage
source: • Route to destination
ar: • المسار إلى الوجهة
ku: • ڕێگە بۆ ناوچە
tr: • Hedefe rota

# gpsBasedNavigationMessage
source: • GPS-based navigation
ar: • ملاحة تعتمد على GPS
ku: • ڕێنمایی بە پێی GPS
tr: • GPS tabanlı navigasyon

# cleanInterfaceMessage
source: • Clean interface
ar: • واجهة نظيفة
ku: • ڕووکاری پاک
tr: • Temiz arayüz

# noDirectionControlsMessage
source: • No direction controls
ar: • بدون عناصر تحكم في الاتجاه
ku: • هیچ کۆنترۆڵێکی ئاراستە نییە
tr: • Yön kontrolleri yok

# focusOnRoadAheadMessage
source: • Focus on the road ahead
ar: • التركيز على الطريق أمامك
ku: • سەرنج لەسەر ڕێگەی پێشەوە
tr: • Öndeki yola odaklan

# actualMovementTrackingInstructionsTitle
source: Actual phone movement tracking:
ar: تتبع حركة الهاتف الفعلية:
ku: شوێنکەوتنی جووڵەی ڕاستەقینەی مۆبایل:
tr: Gerçek telefon hareket takibi:

# tripStatusSuccessMessage
source: Trip status updated successfully
ar: تم تحديث حالة الرحلة بنجاح
ku: دۆخی گەشت بە سەرکەوتوویی نوێکرایەوە
tr: Yolculuk durumu başarıyla güncellendi

# errorUpdatingTripMessage
source: Error updating trip status
ar: خطأ في تحديث حالة الرحلة
ku: هەڵە لە نوێکردنەوەی دۆخی گەشت
tr: Yolculuk durumu güncellenirken hata

# speedLabel
source: Speed
ar: السرعة
ku: خێرایی
tr: Hız

# debugInfoTitle
source: Debug Info
ar: معلومات التصحيح
ku: زانیاری هەڵەگرتنەوە
tr: Hata Ayıklama Bilgisi

# statusStatusLabel
source: Status: {status}
ar: الحالة: {status}
ku: دۆخ: {status}
tr: Durum: {status}

# distanceDistanceLabel
source: Distance: {distance} km
ar: المسافة: {distance} كم
ku: دووری: {distance} کیلۆمەتر
tr: Mesafe: {distance} km

# autoArrivalAutoArrivalLabel
source: Auto-arrival within 150m
ar: الوصول التلقائي ضمن 150 متر
ku: خۆکارانە گەیشتن لە ماوەی ١٥٠م
tr: 150m içinde otomatik varış
