Repository: omarvbnet/khidma-app
Catalog: waddiny/lib/l10n/app_*.arb
Languages: ar, ku, tr

# actualLabel
source: Actual
ar: فعلي
ku: ڕاستەقینە
tr: Gerçek

# movementLabel
source: Movement
ar: الحركة
ku: جووڵە
tr: Hareket

# resetButton
source: Reset
ar: إعادة تعيين
ku: ڕێکخستنەوە
tr: Sıfırla

# northLabel
source: North
ar: الشمال
ku: باکوور
tr: Kuzey

# closeToPickupLocationMessage
source: Close to pickup location
ar: قريب من موقع الاستلام
ku: لە نزیک شوێنی وەرگرتن
tr: Alış konumuna yakın

# iHaveArrivedButton
source: I have arrived
ar: لقد وصلت
ku: هاتم
tr: Vardım

# userPickedUpButton
source: User picked up
ar: تم استلام المستخدم
ku: بەکارهێنەر وەرگیرا
tr: Kullanıcı alındı

# confirmPickedUpButton
source: Confirm picked up
ar: تأكيد الاستلام
ku: وەرگرتنەکە پشتڕاست بکەرەوە
tr: Alındığını onayla

# youHaveArrivedAtYourDestinationMessage
source: You have arrived at your destination
ar: لقد وصلت إلى وجهتك
ku: گەیشتیت بۆ ناوچەکەت
tr: Hedefinize vardınız

# completeTripButton
source: Complete Trip
ar: إكمال الرحلة
ku: گەشتەکە تەواو بکە
tr: Yolculuğu Tamamla

# waitingForDriverMessage
source: Waiting for driver
ar: في انتظار السائق
ku: چاوەڕوانی شۆفێر
tr: Sürücü bekleniyor

# driverAcceptedMessage
source: Driver accepted
ar: قبل السائق
ku: شۆفێر قبوڵی کرد
tr: Sürücü kabul etti

# driverIsOnTheWayMessage
source: Driver is on the way
ar: السائق في الطريق
ku: شۆفێر لە ڕێگەدایە
tr: Sürücü yolda

# driverHasArrivedMessage
source: Driver has arrived
ar: وصل السائق
ku: شۆفێر هات
tr: Sürücü vardı

# youArePickedUpMessage
source: You are picked up
ar: تم استلامك
ku: وەرگیرایت
tr: Alındınız

# onTheWayToDestinationMessage
source: On the way to destination
ar: في الطريق إلى الوجهة
ku: لە ڕێگەدا بۆ ناوچە
tr: Hedefe giderken

# tripCompletedMessage
source: Trip completed
ar: اكتملت الرحلة
ku: گەشتەکە تەواو بوو
tr: Yolculuk tamamlandı

# unknownStatusMessage
source: Unknown status
ar: حالة غير معروفة
ku: دۆخی نەناسراو
tr: Bilinmeyen durum

# mapsMeNavigationTitle
source: Maps.me Navigation
ar: ملاحة Maps.me
ku: ڕێنمایی Maps.me
tr: Maps.me Navigasyonu

# mapsMeStyleNavigationInstructionsTitle
source: Maps.me style navigation instructions:
ar: تعليمات ملاحة نمط Maps.me:
ku: ڕێنمایی بە شێوەی Maps.me:
tr: Maps.me tarzı navigasyon talimatları:

# userNavigationTitle
source: User Navigation
ar: ملاحة المستخدم
ku: ڕێنمایی بەکارهێنەر
tr: Kullanıcı Navigasyonu

# arrivedAtPickupMessage
source: Arrived at Pickup
ar: وصل إلى موقع الاستلام
ku: گەیشت بۆ شوێنی وەرگرتن
tr: Alış Noktasına Vardı

# arrivedAtDropoffMessage
source: Arrived at Dropoff
ar: وصل إلى موقع النزول
ku: گەیشت بۆ شوێنی دانان
tr: Bırakış Noktasına Vardı

# pickupPassengerButton
source: Pickup Passenger
ar: استلام الراكب
ku: سەرنشین وەربگرە
tr: Yolcu Al

# cancelTripButton
source: Cancel Trip
ar: إلغاء الرحلة
ku: گەشتەکە هەڵوەشێنەرەوە
tr: Yolculuğu İptal Et

# driverNearMessage
source: Driver is near!
ar: السائق قريب!
ku: شۆفێر لە نزیکدایە!
tr: Sürücü yakın!

# driverApproachingMessage
source: Your driver is approaching your location
ar: سائقك يقترب من موقعك
ku: شۆفێرەکەت لە نزیک شوێنەکەتە
tr: Sürücünüz konumunuza yaklaşıyor

# tripCancelledMessage
source: Trip Cancelled
ar: تم إلغاء الرحلة
ku: گەشتەکە هەڵوەشێندرایەوە
tr: Yolculuk İptal Edildi

# tripInProgressMessage
source: Trip in Progress
ar: الرحلة قيد التنفيذ
ku: گەشت لە پڕۆسەدایە
tr: Yolculuk Devam Ediyor

# driverOnWayMessage
source: Driver on the way
ar: السائق في الطريق
ku: شۆفێر لە ڕێگەدایە
tr: Sürücü yolda

# driverArrivedMessage
source: Driver arrived
ar: وصل السائق
ku: شۆفێر هات
tr: Sürücü vardı

# passengerPickedUpMessage
source: Passenger picked up
ar: تم استلام الراكب
ku: سەرنشین وەرگیرا
tr: Yolcu alındı

# arrivedAtDestinationMessage
source: Arrived at destination
ar: وصل إلى الوجهة
ku: گەیشت بۆ ناوچە
tr: Hedefe vardı

# notificationsTitle
source: Notifications
ar: الإشعارات
ku: ئاگادارکردنەوەکان
tr: Bildirimler

# noNotificationsMessage
source: No notifications
ar: لا توجد إشعارات
ku: هیچ ئاگادارکردنەوەیەک نییە
tr: Bildirim yok

# markAllReadButton
source: Mark all as read
ar: تحديد الكل كمقروء
ku: هەموویان وەک خوێندراوە نیشانە بکە
tr: Tümünü okundu olarak işaretle

# clearAllButton
source: Clear all
ar: مسح الكل
ku: هەموویان پاک بکەرەوە
tr: Tümünü temizle

# tripsTitle
source: Trips
ar: الرحلات
ku: گەشتەکان
tr: Yolculuklar

# tripHistoryTitle
source: Trip History
ar: سجل الرحلات
ku: مێژووی گەشت
tr: Yolculuk Geçmişi

# activeTripsTitle
source: Active Trips
ar: الرحلات النشطة
ku: گەشتە چالاکەکان
tr: Aktif Yolculuklar

# completedTripsTitle
source: Completed Trips
ar: الرحلات المكتملة
ku: گەشتە تەواوکراوەکان
tr: Tamamlanan Yolculuklar

# cancelledTripsTitle
source: Cancelled Trips
ar: الرحلات الملغاة
ku: گەشتە هەڵوەشێندراوەکان
tr: İptal Edilen Yolculuklar

# noActiveTripsMessage
source: No active trips
ar: لا توجد رحلات نشطة
ku: هیچ گەشتی چالاک نییە
tr: Aktif yolculuk yok

# noCompletedTripsMessage
source: No completed trips
ar: لا توجد رحلات مكتملة
ku: هیچ گەشتی تەواوکراو نییە
tr: Tamamlanan yolculuk yok

# noCancelledTripsMessage
source: No cancelled trips
ar: لا توجد رحلات ملغاة
ku: هیچ گەشتی هەڵوەشێندراو نییە
tr: İptal edilen yolculuk yok

# logoutButton
source: Logout
ar: تسجيل الخروج
ku: چوونەدەرەوە
tr: Çıkış Yap

# settingsTitle
source: Settings
ar: الإعدادات
ku: ڕێکخستنەکان
tr: Ayarlar

# helpTitle
source: Help
ar: المساعدة
ku: یارمەتی
tr: Yardım

# supportTitle
source: Support
ar: الدعم
ku: پشتیوانی
tr: Destek

# aboutTitle
source: About
ar: حول
ku: دەربارە
tr: Hakkında

# versionLabel
source: Version
ar: الإصدار
ku: وەشان
tr: Sürüm

# privacyPolicyTitle
source: Privacy Policy
ar: سياسة الخصوصية
ku: سیاسەتی تایبەتمەندی
tr: Gizlilik Politikası

# termsOfServiceTitle
source: Terms of Service
ar: شروط الخدمة
ku: مەرجەکانی خزمەتگوزاری
tr: Kullanım Şartları

# cancelButton
source: Cancel
ar: إلغاء
ku: هەڵوەشێنەرەوە
tr: İptal

# yesButton
source: Yes
ar: نعم
ku: بەڵێ
tr: Evet

# noButton
source: No
ar: لا
ku: نەخێر
tr: Hayır

# saveButton
source: Save
ar: حفظ
ku: پاشەکەوت بکە
tr: Kaydet

# editButton
source: Edit
ar: تعديل
ku: دەستکاری بکە
tr: Düzenle

# deleteButton
source: Delete
ar: حذف
ku: سڕینەوە
tr: Sil

# confirmButton
source: Confirm
ar: تأكيد
ku: پشتڕاست بکەرەوە
tr: Onayla

# backButton
source: Back
ar: رجوع
ku: گەڕانەوە
tr: Geri

# nextButton
source: Next
ar: التالي
ku: دواتر
tr: İleri

# previousButton
source: Previous
ar: السابق
ku: پێشوو
tr: Önceki

# closeButton
source: Close
ar: إغلاق
ku: داخستن
tr: Kapat

# doneButton
source: Done
ar: تم
ku: تەواو
tr: Tamam

# loadingMessage
source: Loading...
ar: جاري التحميل...
ku: بار دەکرێت...
tr: Yükleniyor...

# errorTitle
source: Error
ar: خطأ
ku: هەڵە
tr: Hata

# successTitle
source: Success
ar: نجح
ku: سەرکەوتوو
tr: Başarılı

# warningTitle
source: Warning
ar: تحذير
ku: ئاگادارکردنەوە
tr: Uyarı

# infoTitle
source: Information
ar: معلومات
ku: زانیاری
tr: Bilgi

# permissionsTitle
source: Permissions
ar: الأذونات
ku: مۆڵەتەکان
tr: İzinler

# locationPermissionTitle
source: Location Permission
ar: إذن الموقع
ku: مۆڵەتی شوێن
tr: Konum İzni

# notificationPermissionTitle
source: Notification Permission
ar: إذن الإشعارات
ku: مۆڵەتی ئاگادارکردنەوە
tr: Bildirim İzni

# cameraPermissionTitle
source: Camera Permission
ar: إذن الكاميرا
ku: مۆڵەتی کامێرا
tr: Kamera İzni

# microphonePermissionTitle
source: Microphone Permission
ar: إذن الميكروفون
ku: مۆڵەتی مایکرۆفۆن
tr: Mikrofon İzni

# permissionRequiredTitle
source: Permission Required
ar: الأذن مطلوب
ku: مۆڵەت پێویستە
tr: İzin Gerekli

# permissionDeniedMessage
source: Permission Denied
ar: تم رفض الإذن
ku: مۆڵەت ڕەتکرایەوە
tr: İzin Reddedildi

# permissionGrantedMessage
source: Permission Granted
ar: تم منح الإذن
ku: مۆڵەت درا
tr: İzin Verildi

# enablePermissionsMessage
source: Please enable the required permissions in your device settings.
ar: يرجى تمكين الأذونات المطلوبة في إعدادات جهازك.
ku: تکایە مۆڵەتە پێویستەکان لە ڕێکخستنەکانی ئامێرەکەت چالاک بکە.
tr: Lütfen gerekli izinleri cihaz ayarlarınızda etkinleştirin.

# networkTitle
source: Network
ar: الشبكة
ku: تۆڕ
tr: Ağ

# noInternetConnectionMessage
source: No internet connection
ar: لا يوجد اتصال بالإنترنت
ku: هیچ پەیوەندی ئینتەرنێت نییە
tr: İnternet bağlantısı yok

# checkConnectionMessage
source: Please check your internet connection and try again.
ar: يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.
ku: تکایە پەیوەندی ئینتەرنێتت پشکنە و دووبارە هەوڵبدە.
tr: Lütfen internet bağlantınızı kontrol edin ve tekrar deneyin.

# serverErrorMessage
source: Server error
ar: خطأ في الخادم
ku: هەڵەی سێرڤەر
tr: Sunucu hatası

# timeoutMessage
source: Request timeout
ar: انتهت مهلة الطلب
ku: کاتی داواکاری تەواو بوو
tr: İstek zaman aşımı

# connectionErrorMessage
source: Connection error
ar: خطأ في الاتصال
ku: هەڵەی پەیوەندی
tr: Bağlantı hatası

# mapTitle
source: Map
ar: الخريطة
ku: نەخشە
tr: Harita

# currentLocationLabel
source: Current Location
ar: الموقع الحالي
ku: شوێنی ئێستا
tr: Mevcut Konum

# destinationLabel
source: Destination
ar: الوجهة
ku: ناوچە
tr: Hedef

# routeLabel
source: Route
ar: المسار
ku: ڕێگە
tr: Rota

# directionsLabel
source: Directions
ar: الاتجاهات
ku: ئاراستەکان
tr: Yönler

# navigationTitle
source: Navigation
ar: الملاحة
ku: ڕێنمایی
tr: Navigasyon

# locationLabel
source: Location
ar: الموقع
ku: شوێن
tr: Konum

# addressLabel
source: Address
ar: العنوان
ku: ناونیشان
tr: Adres

# coordinatesLabel
source: Coordinates
ar: الإحداثيات
ku: ناونیشانەکان
tr: Koordinatlar

# timeLabel
source: Time
ar: الوقت
ku: کات
tr: Zaman

# durationLabel
source: Duration
ar: المدة
ku: ماوە
tr: Süre

# estimatedTimeLabel
source: Estimated Time
ar: الوقت المقدر
ku: کاتی خەملاندن
tr: Tahmini Süre

# arrivalTimeLabel
source: Arrival Time
ar: وقت الوصول
ku: کاتی گەیشتن
tr: Varış Zamanı

# departureTimeLabel
source: Departure Time
ar: وقت المغادرة
ku: کاتی ڕۆشتن
tr: Kalkış Zamanı

# currencyLabel
source: IQD
ar: دينار
ku: دینار

# amountLabel
source: Amount
ar: المبلغ
ku: بڕ
tr: Miktar

# totalLabel
source: Total
ar: المجموع
ku: کۆی گشتی
tr: Toplam

# subtotalLabel
source: Subtotal
ar: المجموع الفرعي
ku: کۆی ناوەڕاست
tr: Ara Toplam

# taxLabel
source: Tax
ar: الضريبة
ku: باج
tr: Vergi

# discountLabel
source: Discount
ar: الخصم
ku: داشکاندن
tr: İndirim

# feeLabel
source: Fee
ar: الرسوم
ku: کرێ
tr: Ücret

# costLabel
source: Cost
ar: التكلفة
ku: تێچوو
tr: Maliyet

# fareLabel
source: Fare
ar: الأجرة
ku: کرێ
tr: Ücret

source: Trip started successfully!
ar: تم بدء الرحلة بنجاح!
ku: گەشتەکە بە سەرکەوتوویی دەستی پێکرد!
tr: Yolculuk başarıyla başlatıldı!

# errorStartingTrip
source: Error starting trip: {error}
ar: خطأ في بدء الرحلة: {error}
ku: هەڵە لە دەستپێکردنی گەشت: {error}
tr: Yolculuk başlatılırken hata: {error}

# tripAcceptedTitle
source: Trip Accepted
ar: تم قبول الرحلة
ku: گەشت قبوڵکرا
tr: Yolculuk Kabul Edildi

# userLabel
source: User
ar: المستخدم
ku: بەکارهێنەر
tr: Kullanıcı

# phoneLabel
source: Phone
ar: الهاتف
ku: تەلەفۆن
tr: Telefon

# startTripButton
source: Start Trip
ar: ابدأ الرحلة
ku: گەشتەکە دەستپێبکە
tr: Yolculuğu Başlat

source: Error getting current location
ar: خطأ في الحصول على الموقع الحالي
ku: هەڵە لە وەرگرتنی شوێنی ئێستا
tr: Mevcut konum alınırken hata

source: Error getting route
ar: خطأ في الحصول على المسار
ku: هەڵە لە وەرگرتنی ڕێڕەوی گەشت
tr: Rota alınırken hata

source: Please select pickup and dropoff locations
ar: يرجى اختيار مواقع الاستلام والنزول
ku: تکایە شوێنی دەستپێک و کۆتایی هەڵبژێرە
tr: Lütfen alış ve bırakış konumlarını seçin

source: User not authenticated
ar: المستخدم غير مصدق
ku: بەکارهێنەر پشتڕاست نەکراوە
tr: Kullanıcı doğrulanmadı

source: You already have an active trip. Please wait for it to be completed or cancelled.
ar: لديك بالفعل رحلة نشطة. يرجى الانتظار حتى تكتمل أو تُلغى.
ku: تۆ پێشتر گەشتی چالاکت هەیە. تکایە چاوەڕێ بکە تا تەواو بێت یان هەڵوەشێندرێت.
tr: Zaten aktif bir yolculuğunuz var. Lütfen tamamlanmasını veya iptal edilmesini bekleyin.

source: Unknown
ar: غير معروف
ku: نەناسراو
tr: Bilinmiyor

source: Baghdad
ar: بغداد
ku: بەغدا
tr: Bağdat

source: User profile is incomplete. Please update your profile with name and phone number.
ar: ملف المستخدم غير مكتمل. يرجى تحديث ملفك بالاسم ورقم الهاتف.
ku: پڕۆفایلی بەکارهێنەر تەواو نییە. تکایە ناو و ژمارەی تەلەفۆن زیاد بکە.
tr: Kullanıcı profili eksik. Lütfen adınızı ve telefon numaranızı güncelleyin.

source: Notifying available drivers...
ar: يتم إشعار السائقين المتاحين...
ku: ئاگادارکردنەوەی شۆفێرە بەردەستەکان...
tr: Mevcut sürücüler bilgilendiriliyor...

source: Failed to get predictions
ar: فشل في الحصول على الاقتراحات
ku: شکستی لە وەرگرتنی پێشنیارەکان
tr: Tahminler alınamadı

source: Location is too far from your current position. Please search for a closer location.
ar: الموقع بعيد جدًا عن موقعك الحالي. يرجى البحث عن موقع أقرب.
ku: شوێن زۆر دوورە لە شوێنی ئێستای تۆ. تکایە شوێنێکی نزیکتر بگەڕێوە.
tr: Konum mevcut konumunuzdan çok uzakta. Lütfen daha yakın bir konum arayın.

source: Use Anyway
ar: استخدم على أي حال
ku: بەهەر حالێک بەکارهێنە
tr: Yine de kullan

source: Failed to get place details
ar: فشل في الحصول على تفاصيل الموقع
ku: شکستی لە وەرگرتنی وردەکاری شوێن
tr: Yer detayları alınamadı

source: Error getting place details
ar: خطأ في الحصول على تفاصيل الموقع
ku: هەڵە لە وەرگرتنی وردەکاری شوێن
tr: Yer detayları alınırken hata

source: Destination set to:
ar: تم تعيين الوجهة:
ku: ئامانج دانرا بۆ:
tr: Hedef ayarlandı:

source: Creating Trip...
ar: جاري إنشاء الرحلة...
ku: گەشت دروست دەکرێت...
tr: Yolculuk oluşturuluyor...

source: Book Trip
ar: احجز الرحلة
ku: گەشت بکە
tr: Yolculuk Yap

source: Change Trip
ar: تغيير الرحلة
ku: گۆڕینی گەشت
tr: Yolculuğu Değiştir

source: Select Locations
ar: اختر المواقع
ku: شوێنەکان هەڵبژێرە
tr: Konumları Seç

source: Selected Location
ar: الموقع المحدد
ku: شوێنی هەڵبژێراو
tr: Seçilen Konum

source: Search for destination...
ar: ابحث عن وجهة...
ku: گەڕان بۆ ئامانج...
tr: Hedef ara...

source: Tap to set as destination
ar: اضغط لتعيين كوجهة
ku: کلیک بکە بۆ دانانی وەک ئامانج
tr: Hedef olarak ayarla

source: Search for destinations within 50km of your current position
ar: ابحث عن وجهات ضمن 50 كم من موقعك الحالي
ku: گەڕان بۆ ئامانجەکان لە ناو ٥٠ کم لە شوێنی ئێستای تۆدا
tr: Mevcut konumunuzdan 50km içinde hedefler arayın
